app/Controllers/AuthController.php

    public function login()
    {
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $userModel = new User();
        $user = $userModel->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'ramadhan@mangan.id'
AND `users`.`deleted_at` IS NULL
 LIMIT 1