app/Controllers/DashboardController.php

SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
AND `users`.`id` = 'GZ2ZazvNZG'
SELECT COUNT(*) AS `numrows`
FROM `transactions`
WHERE `transactions`.`deleted_at` IS NULL
SELECT SUM(`price_total`) AS `price_total`
FROM `transactions`
---
    public function index()
    {
        $profile = new User();
        $profile = $profile->find(session()->get('SES_AUTH_USER_ID'));

        $hour = date('H');
        $greeting = $this->greeting($hour);

        $transactionModel = new Transaction();
        $transactionCount = $transactionModel->countAllResults();
        $db = Database::connect();
        $transactionSumQuery = $db->table('transactions')->selectSum('price_total')->get()->getRow();