app/Controllers/MenuController.php

    public function index()
    {
        $model = new Menu();
        $pass = [
            'model' => $model,
            'menus' => $model->orderBy('is_best_seller', 'DESC')->orderBy('updated_at', 'DESC')->paginate(10),
---
SELECT *
FROM `menus`
WHERE `menus`.`deleted_at` IS NULL
ORDER BY `is_best_seller` DESC, `updated_at` DESC
 LIMIT 10