app/Controllers/MenuController.php

SELECT COUNT(*) AS `numrows`
FROM `menus`
WHERE `menus`.`deleted_at` IS NULL
SELECT *
FROM `menus`
WHERE `menus`.`deleted_at` IS NULL
ORDER BY `created_at` DESC
 LIMIT 10
---
    public function index()
    {
        $model = new Menu();
        $pass = [
            'model' => $model,
            'menus' => $model->orderBy('created_at', 'DESC')->paginate(10),
            'pager' => $model->pager,
        ];

SELECT *
FROM `menus`
WHERE `menus`.`deleted_at` IS NULL
AND `menus`.`id` = 'MENU000017'
SELECT *
FROM `menu_categories`
WHERE `menu_categories`.`deleted_at` IS NULL
ORDER BY `id` ASC
---
    public function edit($id)
    {
        $model = new Menu();
        $modelCategory = new MenuCategory();
        $pass = [
            'data' => $model->find($id),
            'menuCategories' => $modelCategory->orderBy('id', 'ASC')->findAll()
        ];

UPDATE `menus` SET `menu_category_id` = 'KTMENU0002', `name` = 'awdawdaw', `price` = 3333, `updated_at` = '2023-06-16 19:25:17'
WHERE `menus`.`id` IN ('MENU000017')
---
    public function setStatus($id)
    {
        $model = new Menu();
        $find = $model->find($id);
        $data = [
            'is_available' => !$find['is_available'],
        ];

        $model->update($id, $data);