app/Controllers/MenuCategoryController.php

    public function index()
    {
        $model = new MenuCategory();
        $pass = [
            'menuCategories' => $model->orderBy('created_at', 'DESC')->paginate(5),
            'pager' => $model->pager,
        ];
---
SELECT *
FROM `menu_categories`
WHERE `menu_categories`.`deleted_at` IS NULL
ORDER BY `created_at` DESC
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `menu_categories`
WHERE `menu_categories`.`deleted_at` IS NULL