app/Controllers/OrderTransactionController.php

SELECT *
FROM `transactions`
WHERE `transactions`.`deleted_at` IS NULL
AND `transactions`.`id` = 'uP5CQZSLAD'
---
    public function index($id)
    {
        $transactionModel = new Transaction();
        $transaction = $transactionModel->find($id);