app/Controllers/OrderCartController.php

SELECT *
FROM `reservation_table_carts`
WHERE `reservation_table_id` = 'TBLE0001'
AND `reservation_table_carts`.`deleted_at` IS NULL
ORDER BY `updated_at` DESC
---
    public function index()
    {
        $reservationTableId = session()->get('SES_AUTH_CUSTOMER_TABLE');
        $reservationTableCartModel = new ReservationTableCart();
        $reservationTableCarts = $reservationTableCartModel->where('reservation_table_id', $reservationTableId)->orderBy('updated_at', 'DESC')->findAll();