app/Controllers/OrderController.php

SELECT *
FROM `menu_categories`
WHERE `menu_categories`.`deleted_at` IS NULL
ORDER BY `id` ASC
SELECT *
FROM `menus`
WHERE `menu_category_id` = 'KTMENU0001'
AND `menus`.`deleted_at` IS NULL
ORDER BY `is_best_seller` DESC, `is_available` ASC, `created_at` ASC
 LIMIT 9
SELECT COUNT(*) AS `numrows`
FROM `menus`
WHERE `menu_category_id` = 'KTMENU0001'
AND `menus`.`deleted_at` IS NULL
---
    public function index()
    {
        $modelMenu = new Menu();
        $modelMenuCategoy = new MenuCategory();

        $menuCategorySelected = $this->request->getGet('category-id');

        $menus = $modelMenu;
        if ($menuCategorySelected) {
            $menus = $menus->where('menu_category_id', $menuCategorySelected);
        }
        $menus = $menus->orderBy('is_best_seller', 'DESC')->orderBy('is_available', 'DESC')->orderBy('created_at', 'ASC')->paginate(9);

        $pass = [
            'menuCategories'=> $modelMenuCategoy->orderBy('id', 'ASC')->findAll(),
            'menuCategorySelected' => $menuCategorySelected,

            'modelMenu' => $modelMenu,
            'menus' => $menus,
            'menusPager' => $modelMenu->pager,
        ];