app/Controllers/PaymentMethodController.php

SELECT *
FROM `payment_methods`
WHERE `payment_methods`.`deleted_at` IS NULL
ORDER BY `created_at` DESC
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `payment_methods`
WHERE `payment_methods`.`deleted_at` IS NULL
---
    public function index()
    {
        $model = new PaymentMethod();
        $pass = [
            'paymentMethods' => $model->orderBy('created_at', 'DESC')->paginate(5),
            'pager' => $model->pager,
        ];