app/Controllers/ReservationTableController.php

SELECT *
FROM `reservation_tables`
WHERE `reservation_tables`.`deleted_at` IS NULL
ORDER BY `created_at` DESC
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `reservation_tables`
WHERE `reservation_tables`.`deleted_at` IS NULL
---
    public function index()
    {
        $model = new ReservationTable();
        $pass = [
            'reservationTables' => $model->orderBy('created_at', 'DESC')->paginate(5),
            'pager' => $model->pager,
        ];