app/Controllers/ReservationTableController.php

    public function index()
    {
        $model = new ReservationTable();
        $datas = $model->orderBy('created_at', 'DESC')->findAll();
---
SELECT *
FROM `reservation_tables`
WHERE `reservation_tables`.`deleted_at` IS NULL
ORDER BY `created_at` DESC