app/Controllers/TableController.php

SELECT *
FROM `tables`
WHERE `tables`.`deleted_at` IS NULL
ORDER BY `created_at` DESC
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `tables`
WHERE `tables`.`deleted_at` IS NULL
---
    public function index()
    {
        $model = new Table();
        $pass = [
            'tables' => $model->orderBy('created_at', 'DESC')->paginate(5),
            'pager' => $model->pager,
        ];