app/Controllers/TransactionController.php

SELECT *
FROM `transactions`
WHERE `transactions`.`deleted_at` IS NULL
ORDER BY `created_at` DESC
SELECT *
FROM `payment_methods`
WHERE `payment_methods`.`deleted_at` IS NULL
ORDER BY `name` ASC
---
    public function index()
    {
        $modelTransaction = new Transaction();
        $modelPaymentMethod = new PaymentMethod();
        $pass = [
            'modelTransaction' => $modelTransaction,
            'transaction' => $modelTransaction->orderBy('created_at', 'DESC')->findAll(),
            'paymentMethods' => $modelPaymentMethod->orderBy('name', 'ASC')->findAll(),