app/Models/Menu.php

    public function getCategory($menuCategoryId)
    {
        $categoryModel = new MenuCategory();
        $category = $categoryModel->find($menuCategoryId);
---
SELECT *
FROM `menu_categories`
WHERE `menu_categories`.`deleted_at` IS NULL
AND `menu_categories`.`id` = 'KTMENU0001'