app/Models/ReservationTableCart.php

SELECT *
FROM `menus`
WHERE `menus`.`deleted_at` IS NULL
AND `menus`.`id` = 'MENU000007'
---
    public function getMenu($menuId)
    {
        $menuModel = new Menu();
        $data = $menuModel->find($menuId);

SELECT *
FROM `menus`
WHERE `menus`.`deleted_at` IS NULL
AND `menus`.`id` = 'MENU000007'
SELECT *
FROM `menus`
WHERE `menus`.`deleted_at` IS NULL
AND `menus`.`id` = 'MENU000005'
SELECT *
FROM `menu_categories`
WHERE `menu_categories`.`deleted_at` IS NULL
AND `menu_categories`.`id` = 'KTMENU0003'
---
    public function getMenuCategory($menuId)
    {
        $menuModel = new Menu();
        $data = $menuModel->find($menuId);

        if ($data) {
            $menuCategoryModel = new MenuCategory();
            $dataCat = $menuCategoryModel->find($data['menu_category_id']);