app/Models/Transaction.php

SELECT *
FROM `transaction_menus`
WHERE `transaction_id` = 'uP5CQZSLAD'
AND `transaction_menus`.`deleted_at` IS NULL
---
    public function getTransactionMenus($transactionId)
    {
        $db = Database::connect();
        $transactionMenuModel = $db->table('transaction_menus')->where('transaction_id', $transactionId)->get();
        $db->close();
        $data = $transactionMenuModel->getResultArray();

SELECT *
FROM `reservation_tables`
WHERE `id` = 'TBLE0003'
SELECT *
FROM `reservation_tables`
WHERE `reservation_tables`.`deleted_at` IS NULL
AND `reservation_tables`.`id` = 'TBLE0008'
---
    public function getReservationTable($reservationTableId)
    {
        $db = Database::connect();
        $reservationTable = $db->table('reservation_tables')->where('id', $reservationTableId)->get();
        $db->close();
        $data = $reservationTable->getRowArray();