app/Views/layouts/partials/navbar-customer.php

SELECT *
FROM `reservation_tables`
WHERE `reservation_tables`.`deleted_at` IS NULL
AND `reservation_tables`.`id` = 'TBLE0001'
SELECT *
FROM `reservation_table_carts`
WHERE `reservation_table_id` = 'TBLE0001'
AND `reservation_table_carts`.`deleted_at` IS NULL
---
<?php
$reservationTableId = session()->get('SES_AUTH_CUSTOMER_TABLE');
$reservationTable = new App\Models\ReservationTable();
$reservationTable = $reservationTable->find($reservationTableId);

$reservationTableCart = new App\Models\ReservationTableCart();
$reservationTableCart = $reservationTableCart->where('reservation_table_id', $reservationTableId)->findAll();